### Import the libraries

In [ ]:
import pandas as pd
import seaborn as sns
import matplotlib.pyplot as plt
from sklearn.model_selection import train_test_split
from sklearn.metrics import accuracy_score
from sklearn.naive_bayes import GaussianNB
from sklearn.tree import DecisionTreeClassifier

### Read the data

In [ ]:
from google.colab import drive
drive.mount('/content/drive')

Drive already mounted at /content/drive; to attempt to forcibly remount, call drive.mount("/content/drive", force_remount=True).

In [ ]:
df_adult = pd.read_csv('/content/drive/My Drive/Projects_shai/Projects data/adult.csv')

In [ ]:
df_adult.shape

(48842, 15)

In [ ]:
df_adult.head().style.hide()

In [ ]:
df_adult.drop_duplicates(inplace=True)

###number of row and column

In [ ]:
df_adult.shape

(48813, 15)

###Information about data set

In [ ]:
df_adult.info()

<class 'pandas.core.frame.DataFrame'>
Index: 48813 entries, 0 to 48841
Data columns (total 15 columns):
 #   Column          Non-Null Count  Dtype
---  ------          --------------  -----
 0   age             48813 non-null  int64
 1   workclass       47850 non-null  object
 2   fnlwgt          48813 non-null  int64
 3   education       48813 non-null  object
 4   education-num   48813 non-null  int64
 5   marital-status  48813 non-null  object
 6   occupation      47847 non-null  object
 7   relationship    48813 non-null  object
 8   race            48813 non-null  object
 9   sex             48813 non-null  object
 10  capital-gain    48813 non-null  int64
 11  capital-loss    48813 non-null  int64
 12  hours-per-week  48813 non-null  int64
 13  native-country  48539 non-null  object
 14  income          48813 non-null  object
dtypes: int64(6), object(9)
memory usage: 6.0+ MB

In [ ]:
df_adult['income'].value_counts()

income
<=50K     24698
<=50K.    12430
>50K       7839
>50K.      3846
Name: count, dtype: int64

### Cleaning categories from points

In [ ]:
df_adult['income'] = df_adult['income'].replace({'<=50K.': '<=50K', '>50K.': '>50K'})

### Check after cleaning

In [ ]:
df_adult['income'].value_counts()

income
<=50K    37128
>50K     11685
Name: count, dtype: int64

###Check for missing values

In [ ]:
df_adult.isnull().sum()

age                 0
workclass         963
fnlwgt              0
education           0
education-num       0
marital-status      0
occupation        966
relationship        0
race                0
sex                 0
capital-gain        0
capital-loss        0
hours-per-week      0
native-country    274
income              0
dtype: int64

###Converting the categorical category to numerical variations

In [ ]:
data_encoded = pd.get_dummies(df_adult, drop_first=True)

###Segmenting data into features and goals.

In [ ]:
x = data_encoded.drop("income_>50K", axis=1)  # Features
y = data_encoded["income_>50K"]  # Goals

###We split the data into training and test sets.

In [ ]:
X_train, X_test, y_train, y_test = train_test_split(x, y, test_size=0.2, random_state=42)

### Train Naive Bayas Model

In [ ]:
nb_model = GaussianNB()
nb_model.fit(X_train, y_train)

# predict
nb_predictions = nb_model.predict(X_test)

# acc calculate
nb_accuracy = accuracy_score(y_test, nb_predictions)
print(f'Naive Bayes Accuracy : {nb_accuracy:.2f}')

Naive Bayes Accuracy : 0.79

### Train DecisionTree Model

In [ ]:
dt_model = DecisionTreeClassifier(random_state=42)
dt_model.fit(X_train, y_train)

# predict
dt_predictions = dt_model.predict(X_test)

# acc calculate
dt_accuracy = accuracy_score(y_test, dt_predictions)
print(f'Decision Tree Accuracy : {dt_accuracy:.2f}')

Decision Tree Accuracy : 0.81